package KeysWord_this01;

/**
 * 关于Java语言当中的this关键字：
 * 		1.this是一个关键字，翻译为：这个
 * 		2.this是一个引用，this是一个变量，this变量中保存了内存地址指向了自身，
 * 		  this存储在JVM堆内存Java对象内部
 * 		3.创建100个Java对象，每一个对象都有this，也就是说100个不同的this,this存储的是对象本身的地址
 * 		4.this可以出现在“实例方法”当中，代表当前正在执行这个动作的对象。
 *		5.this在多数情况下都是可以省略不写的
 *		6.this不能使用在带有static的方法当中
 *		 
 * @author ASUS
 *
 */
public class Customer {
	
	//姓名
	String name;

	//构造方法
	public Customer(){
		
	}
	
	//不带有static关键字的方法
	//顾客的购物行为
	//每一个顾客购物最终结果是不一样的
	//所以购物这个行为是属于对象界别的行为
	//由于每一个对象在执行购物这个动作的时候最终结果不同，所以购物这个动作必须有“对象”的参与。
	//重点：没有static关键字的方法被称为“实例方法”，实例方法怎么访问：“引用.”的方法
	//重点：没有static关键字的变量被称为：“实例变量”
	//注意：当一个行为/动作执行的过程中是需要对象参与的，那么这个方法一定要定义为“实例方法”，不能带static关键字
	//以下方法为实例方法，因为每一个顾客在购物的时候，最终结果是不同的，所以这个动作在完成的时候必须有对象的参与
	public void shopping(){
		//当张三在购物的时候，输出：张三在购物
		//当李四在购物的时候，输出：李四在购物
		
		System.out.println(name+"在购物！");
		
		//完整写法
		System.out.println(this.name+"在购物!");//this就代表这个对象
		
	}
}
